const textbutton =`
Розробка в IT

Топ-5 спеціалізацій розробників:

- 1. Embedded-розробка (розробка вбудованого програмного забезпечення)
- 2. Розробка мобільних додатків (Android та iOS)
- 3. Front-end розробник
- 4. Back-end розробник
- 5. Gamedev (розробник ігор)

Вибери спеціалізацію, щоб почитати докладніше
`
const text11 =`
1.Embedded-розробка (розробка вбудованого програмного забезпечення)

Практично у всіх пристроях, що оточують нас у повсякденному побуті (і не лише) використовуються мікросхеми. Автомобілі, електричні плити, роботи-пилососи, холодильники, банкомати, пральні та посудомийні машини, роутери, швейні машини... Цей список продовжує розширюватися з кожним днем. Всі ці численні прилади працюють за допомогою електроніки, яку хтось має запрограмувати. Саме цим і займаються embedded-розробники.
Основна мова програмування, що використовується в цій галузі, - це C + +, зустрічаються також асемблер і JAVA, вони застосовуються переважно для низькорівневого програмування.
Поріг входження в цю професію досить високий: C++ і асемблер не належать до найпростіших мов. Крім того, вам знадобиться добре орієнтуватися в тому обладнанні, для якого ви створюватимете програми.
`
const text12=`
OpenUP
Цей метод розробки є ітераційно-інкрементний. Позиціонується як одна із версій RUP. OpenUP ділить життя проекту на чотири фази: початковий етап, фаза специфікації, розробка та передача готового фунціоналу. Життєвий цикл проекту надає зацікавленим особам та членам колективних точку відліку і прийняття рішень протягом всього проекту. В цьому випадку можливо ефективно контролювати процес розробки.
`
const text13=`
Scrum
Встановлює правила для процесу управління розробки програмного забезпечення і дозволяє використовувати існуючу практику кодування, регулювати вимоги або приймати тактичні зміни. Використовуючи цю методику можливо виявити і усунути відхилення від бажаного результату на більш ранніх стадіях розробки програмного забезпечення.
`
const text14=`
Lean software development
Ця методологія розробки програмного забезпечення метод бережливого виробництва (Lean Manufacturing). Основні принципи цієї методології є: максимальна швидка доставка продукції замовнику з дуже короткими ітераціями, мотивація команди і зосередитися на навчанні з короткими циклами розвитку, раннє тестування і зворотній зв’язок з клієнтами.
`
const text15=`
Kanban software development
Канбан реалізує принцип «точно в строк» і урівноважує робоче навантаження між усіма членами команди. За допомогою цього методу весь процес розробки зрозумілий для всіх членів команди. Канбан є візуальною моделлю розвитку, яка показує те, що потрібно виробляти, коли і скільки.
`
const text20=`
Аналітика в IT

У широкому сенсі ІТ-аналітик – фахівець, який збирає та робить висновки на основі даних. Його робочий процес – збір, обробка та подання як результат інформації про те, чого хоче замовник.
В ІТ-індустрії найбільш популярні такі види аналітиків:

- 1. Гіпотеза
- 2. Порівняння
- 3. Узагальнення
- 4. Спостереження
- 5. Системний метод

Вибери спеціалізацію, щоб почитати докладніше
`
const text21=`
Гіпотеза — це науково обґрунтоване припущення про можливі зв´язки, відносини, причини явищ

Спрощеним методом аналогії є відсотковий метод. Виходячи з відомих даних, які характеризують сьогоднішнє становище (ВВП, податкові ставки, обсяги торгівлі), можна визначити відповідні показники на майбутнє.

Цей метод стає ефективним за умов того, що попередньо буде вивчено всю сукупність явищ, які зачіпаються. Лише після цього можна дійти висновку про те, що порівнювані явища такі схожі, що дають можливість вдатися до порівняння.
`
const text22=`
Порівняння — це процес зіставлення предметів або явищ дійсності з метою установлення схожості чи відмінності між ними, а також знаходження загального, притаманного, що може бути властивим двом або кільком об´єктам дослідження.

Метод порівняння буде плідним, якщо при його застосуванні виконуються такі вимоги:

- порівнюватись можуть тільки такі явища, між якими може існувати певна об´єктивна спільність;

- порівняння повинно здійснюватись за найважливішими, найсуттєвішими (у плані конкретного завдання) ознаками.

Порівняння завжди є важливою передумовою узагальнення.
`
const text23=`
Узагальнення — логічний процес переходу від одиничного до загального чи від менш загального до більш загального знання, а також продукт розумової діяльності, форма відображення загальних ознак і якостей об´єктивних явищ.
`
const text24=`
Спостереження - це систематичне цілеспрямоване, спеціально організоване сприймання предметів і явищ об’єктивної дійсності, які виступають об´єктами дослідження

Як метод наукового пізнання спостереження дає можливість одержувати первинну інформацію у вигляді сукупності емпіричних тверджень. Емпірична сукупність стає основою попередньої систематизації об´єктів реальності, роблячи їх вихідними об´єктами наукового дослідження.

Спостереження мусить відповідати таким вимогам:

- передбачуваності заздалегідь (спостереження проводиться для певного, чітко поставленого завдання);

- планомірності (виконується за планом, складеним відповідно до завдання спостереження);

- цілеспрямованості (спостерігаються лише певні сторони явища, котрі викликають інтерес при дослідженні);

- вибірковості (спостерігач активно шукає потрібні об´єкти, риси, явища);

системності (спостереження ведеться безперервно або за певною системою).
`
const text25=`
Системний метод - приведення даних в деяку систему, що дозволяє їх пояснити з позицій системного підходу.

Метод екстраполяції - поширення висновків, отриманих зі спостереження за однією частиною явища на іншу його частину.

Метод ідеалізації - уявна процедура, пов’язана з уявленням чого-небудь як ідеалу і подальшим порівнянням реального об’єкта з ідеальним.

Метод евпатії - входження аналітика в образ аналізованого об’єкта, уявлення себе тим, хто вивчається, осмислення з його позицій дій, що ним здійснюються.
`
const text30=`
Веброзробка — процес створення вебсайтів або вебдодатків. Основними етапами процесу є вебдизайн, верстка сторінок, програмування для веб на стороні клієнта і сервера, а також конфігурування вебсервера.
`
const text31=`
<a href='https://www.youtube.com/watch?v=Rr9QmVLqoP4&list=PLenwk9TUJzJ6ep0oogRRQZHzPMtTGKqF1'>Посилання на відео ⬇️</a>
`
const text32=`
<a href='https://www.youtube.com/watch?v=FrUynyijdSI&list=PLenwk9TUJzJ41x_7o3Z5laAngAuuqfpQW'>Посилання на відео ⬇️</a>
`
const text33=`
<a href='https://www.youtube.com/watch?v=_DCVyFAE6L4&list=PLuY6eeDuleINdUsErp8S2aswgSpNJAq97'>Посилання на відео ⬇️</a>
`
const text34=`
<a href='https://www.youtube.com/watch?v=243pQXC5Ebs&t=5989s'>Посилання на відео ⬇️</a>
`
const text41=`
Промисловий дизайн — використання поєднання прикладного мистецтва і прикладної науки для поліпшення естетики, ергономіки, архітектури, функціональності і зручності використання продукту. Дизайн також може бути застосований для поліпшення конкурентоспроможності продукту
<a href='https://www.youtube.com/watch?v=ZugyTnLLarA&list=PLci-3iDpy3ru3sYYDfilFDBF9TM4IJL1a'>Посилання ви знайдете нище ⬇️</a>
`
const text42=`
Графічний дизайн — це сфера діяльності та навчальна дисципліна, діяльність якої полягає в проектуванні візуальних комунікацій, призначених для передачі повідомлень соціальним групам з визначеними цілями.
<a href='https://www.youtube.com/watch?v=knWC6BAvtYA'>Посилання на відео ⬇️</a>
`
const text43=`
Дизайн середовища є професійною проектно-художньою діяльністю у сфері створення відкритих, напіввідкритих та закритих просторів. Це робота з міським громадським і природним середовищем, внутрішньо будинковими територіями, терасами, виробничими та житловими інтер'єрами.
<a href='https://www.youtube.com/watch?v=ukXnqrMebLM'>Посилання на відео ⬇️</a>
`
const text44=`
Арт-дизайн — напрям постіндустріального дизайну , представники якого прагнули поєднати принципи дизайн-проектування та традиційної художньої творчості (живопису, скульптури, графіки, декоративно-ужиткового мистецтва).
<a href='https://www.youtube.com/watch?v=pqtE0AbBuP0&list=PLRD47MWguwL_uL7wA0r9OMA-dKWyWPfCq'>Посилання на відео ⬇️</a>
`
const text50=`
Ма́рке́тинг — организационная функция и совокупность процессов создания, продвижения и предоставления продукта или услуги покупателям и управление взаимоотношениями с ними с выгодой для организации. Более кратко, маркетинг — деятельность, направленная на удовлетворение рыночных потребностей с целью извлечения прибыли. В общем смысле предназначение маркетинга состоит в «определении и удовлетворении человеческих и общественных потребностей»
<a href='https://www.youtube.com/watch?v=ZmrC1QyQZWk'>Посилання на відео ⬇️</a>
`

module.exports.textbutton = textbutton
module.exports.text11= text11
module.exports.text12= text12
module.exports.text13= text13
module.exports.text14= text14
module.exports.text15= text15
module.exports.text20=text20
module.exports.text21=text21
module.exports.text22=text22
module.exports.text23=text23
module.exports.text24=text24
module.exports.text25=text25
module.exports.text30=text30
module.exports.text31=text31
module.exports.text32=text32
module.exports.text33=text33
module.exports.text34=text34
module.exports.text41=text41
module.exports.text42=text42
module.exports.text43=text43
module.exports.text44=text44
module.exports.text50=text50