const headertext=`
З чого почати?

Одне з найпоширеніших питань від новачків, яке ми чуємо - "Який ЯП вчити?"

Насправді, відповідь на нього ти маєш дати собі сам. Щоб зробити це потрібно зрозуміти, чого ти хочеш і чи хочеш взагалі.

Так, легенди про високі зарплати в айті – правда. Але напрямів в промисловості дуже багато і повір, що йти сюди треба не за грошима. Або хоча б не лише за ними. Роби те, що любиш і кохай те, що робиш. Ось головне посилання.

Якщо ти точно розумієш, що хочеш в IT, слід визначитися з напрямком.

Бувають такі:
- розробка
- дизайн
- менеджмент
- маркетинг
- аналітика
- HR/рекрутинг
- QA/тестування

Нижче ми пропонуємо тобі почитати про кожного з них докладніше.
`
module.exports.text =headertext